example_case/0/cylinder/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0/cylinder";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 -1 -2 0 0 0 0 ];

internalField   uniform 100000;

boundaryField
{
    cylinder_to_fluid		// was steht mit was in Kontakt
    {
        type            calculated;
        value           uniform 100000;
    }

    fluid			// was steht mit was in Kontakt
    {
        type            calculated;
        value           uniform 100000;
    }
}


// ************************************************************************* //
