example_case/0/fluid/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volVectorField;
    location    "0/fluid";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform (0 0 0);			// meistens (0 0 0), oder gleich dem inlet zu setzen

boundaryField
{
    wall
    {
        type            noSlip;
    }

    inlet
    {
        type            fixedValue;
        value           uniform (0 0.1 0);		// Geschwindigkeit am Einlass m/s
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);
    }

    cylinder
	{
	type		fixedValue;
	value		uniform (0 0 0); 	//Haftbedingung
	}	

    fluid_to_cylinder				//hier den Namen aktualisieren
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

   /* 
    heater
	{
	type		fixedValue;
	value		uniform (0 0 0);
	}

    fluid_to_heater				//hier den Namen aktualisieren
    {
        type            fixedValue;
        value           uniform (0 0 0);
    } */
}


// ************************************************************************* //
