example_case/0/fluid/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0.006/fluid";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 -1 -2 0 0 0 0 ];

internalField   uniform 100000;		//aboluter Druck in Pascal

boundaryField
{
	wall
    {
        type            calculated;
        value           uniform 100000;
    }
    inlet
    {
        type            calculated;
        value           uniform 100000;
    }
    outlet
    {
        type            calculated;
        value           uniform 100000;
    }

    cylinder
    {
    	type		calculated;
	value		uniform 100000;
    }
    fluid_to_cylinder			//hier den Namen der eingefügten Regionen angeben
    {
        type            calculated;
        value           uniform 100000;
    }
    fluid_to_heater			//hier den Namen der eingefügten Regionen angeben
    {
        type            calculated;
        value           uniform 100000;
    }

   /* ".*"				//Möglichkeit für alle patches die gleiche BC zu setzen
    {
        type            calculated;
        value           uniform 100000;
    } */
}


// ************************************************************************* //
