example_case/0/fluid/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0.006/fluid";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 -1 -2 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
    wall
    {
        type            fixedFluxPressure;
    }
    inlet
    {
        type            fixedFluxPressure;
    }
    outlet
    {
        type            fixedValue;
        value           $internalField;
    }
    fluid_to_cylinder			//hier den Namen der eingefügten Regionen angeben
    {
        type            fixedFluxPressure;
    }
    fluid_to_heater			//hier den Namen der eingefügten Regionen angeben
    {
        type            fixedFluxPressure;
    }
    
}


// ************************************************************************* //
