example_case/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

xmin -0.1;
xmax 0.1;
zmin 0.9;
zmax 1.1;
ymin 1.9;
ymax 2.2;


deltax 0.005;
deltay 0.005;
deltaz 0.005;

lx #calc "$xmax - $xmin";
ly #calc "$ymax - $ymin";
lz #calc "$zmax - $zmin";

xcells #calc "round($lx/$deltax)";
ycells #calc "round($ly/$deltay)";
zcells #calc "round($lz/$deltaz)";

vertices
(
    //  BLOCK 0
	($xmin	$ymin	$zmin)		//0
	($xmax	$ymin	$zmin)		//1
	($xmax	$ymax	$zmin)		//2
	($xmin	$ymax	$zmin)		//3
	($xmin	$ymin	$zmax)		//4
	($xmax	$ymin	$zmax)		//5
	($xmax	$ymax	$zmax)		//6
	($xmin	$ymax	$zmax)		//7

);

blocks
(
    	hex (0 1 2 3 4 5 6 7) ($xcells $ycells $zcells) simpleGrading (1 1 1)
 	//hex (0 1 2 3 1 5 6 7) (20 20 20) simpleGrading (1 1 1)
);

edges
(

);


boundary
(

inlet
{
	type patch;
	faces
	(
		(1 0 5 4)
	);
}

outlet
{
	type patch;
	faces
	(
		(3 2 6 7)
	);
}

wall
{
	type wall;
	faces
	(
		(0 3 7 4)
		(1 5 6 2)
		(0 1 2 3)
		(4 7 6 5)
	);
}


);

mergePatchPairs
(

);




// ************************************************************************* //
