example_case/system/fluid/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


U
{
    internalField   uniform (0 0 0.001);

    boundaryField
    {
        minX
        {
            type            fixedValue;
            value           uniform (0 0 0.001);
        }

        maxX
        {
            type            inletOutlet;
            inletValue      uniform (0 0 0);
        }

        ".*"
        {
            type            noSlip;
        }
    }
}

T
{
    internalField   uniform 300;

    boundaryField
    {
        minX
        {
            type            fixedValue;
            value           uniform 300;
        }

        maxX
        {
            type            inletOutlet;
            inletValue      uniform 300;
        }

        ".*"
        {
            type            zeroGradient;
            value           uniform 300;
        }

        "fluid_to.*"
        {
            type            compressible::turbulentTemperatureCoupledBaffleMixed;
            Tnbr            T;
            kappaMethod     fluidThermo;
            value           uniform 300;
        }
    }
}

/*
epsilon
{
    internalField   uniform 0.01;
    boundaryField
    {
        minX
        {
            type            fixedValue;
            value           uniform 0.01;
        }
        maxX
        {
            type            inletOutlet;
            inletValue      uniform 0.01;
        }
        ".*"
        {
            type            epsilonWallFunction;
            value           uniform 0.01;
        }
    }
}
k
{
    internalField   uniform 0.1;
    boundaryField
    {
        minX
        {
            type            inletOutlet;
            inletValue      uniform 0.1;
        }
        maxX
        {
            type            zeroGradient;
            value           uniform 0.1;
        }
        ".*"
        {
            type            kqRWallFunction;
            value           uniform 0.1;
        }
    }
}
*/

p_rgh
{
    internalField   uniform 0;

    boundaryField
    {
        minX
        {
            type            zeroGradient;
            value           uniform 0;
        }

        maxX
        {
            type            fixedValue;
            value           uniform 0;
        }

        ".*"
        {
            type            fixedFluxPressure;
            value           uniform 0;
        }
    }
}

p
{
    internalField   uniform 0;

    boundaryField
    {
        ".*"
        {
            type            calculated;
            value           uniform 0;
        }
    }
}

// ************************************************************************* //
