example_case/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

castellatedMesh true;			
snap            true;			
addLayers       true;			

geometry
{
    cylinder.stl
    {
        type 	triSurfaceMesh;
        name	cylinder;

	patchInfo
	{
		type wall;
	}
    }
};

castellatedMeshControls
{

	maxLocalCells	1000000;
	maxGlobalCells 	2000000;
	minRefinementCells 	0;
	nCellsBetweenLevels	1;

features
(
	{
		file "cylinder.eMesh";
		levels ((0.0 2) (0.05 1));
	}
);

refinementSurfaces
{
       
        cylinder
        {
            level (1 2);			
            faceZone cylinder;
            cellZone cylinder;
            cellZoneInside inside;
        }

}

	resolveFeatureAngle	30;

    	refinementRegions
    	{
		box
		{
			mode	outside;			
			levels	((0.02 4)	(0.05 3));	
		}
	}

    	locationInMesh (0 1.92 1);		
						
	allowFreeStandingZoneFaces true;
}


snapControls
{

	nSmoothPatch		3;
	tolerance		1.0;
	nSolveIter		300;
	nRelaxIter		5;

	nFeatureSnapIter	10;
	implicitFeatureSnap 	false;
	explicitFeatureSnap	true;			
	multiRegionFeatureSnap	false;
}

addLayersControls					 
							
{
        relativeSizes       	true;

        minThickness        	0.05;
    	finalLayerThickness 	0.5;
    	expansionRatio      	1.2;
	nGrow			1;

	featureAngle		90;
	slipFeaterAngle		30;
	nRelaxIter 		5;
	nSmoothSurfaceNormals 	1;
	nSmoothNormals 		3;
	nSmoothThickness 	10;
	maxFaceThicknessRatio 	0.5;
	maxThicknessToMedialRatio 0.3;
	minMedianAxisAngle 	90;
	nBufferCellsNoExtrude 	0;
	nLayerIter 		100;
 	
	layers
    	{
		cylinder				
		{
		nSurfaceLayers 5;
		}
	}
}

meshQualityControls
{
//- Maximum non-orthogonality allowed. Set to 180 to disable.
    maxNonOrtho 65;

    //- Max skewness allowed. Set to <0 to disable.
    maxBoundarySkewness 20;
    maxInternalSkewness 4;

    //- Max concaveness allowed. Is angle (in degrees) below which concavity
    //  is allowed. 0 is straight face, <0 would be convex face.
    //  Set to 180 to disable.
    maxConcave 80;

    //- Minimum pyramid volume. Is absolute volume of cell pyramid.
    //  Set to a sensible fraction of the smallest cell volume expected.
    //  Set to very negative number (e.g. -1E30) to disable.
    minVol -1e-13;

    //- Minimum quality of the tet formed by the face-centre
    //  and variable base point minimum decomposition triangles and
    //  the cell centre. This has to be a positive number for tracking
    //  to work. Set to very negative number (e.g. -1E30) to
    //  disable.
    //     <0 = inside out tet,
    //      0 = flat tet
    //      1 = regular tet
    minTetQuality 1e-30;

    //- Minimum face area. Set to <0 to disable.
    minArea -1;

    //- Minimum face twist. Set to <-1 to disable. dot product of face normal
    //- and face centre triangles normal
    minTwist 0.02;

    //- minimum normalised cell determinant
    //- 1 = hex, <= 0 = folded or flattened illegal cell
    minDeterminant 0.001;

    //- minFaceWeight (0 -> 0.5)
    minFaceWeight 0.02;

    //- minVolRatio (0 -> 1)
    minVolRatio 0.01;

    //must be >0 for Fluent compatibility
    minTriangleTwist -1;

    // Advanced

    //- Number of error distribution iterations
    nSmoothScale 4;
    //- amount to scale back displacement at error points
    errorReduction 0.75;
}

mergeTolerance 1e-6;

// ************************************************************************* //
