example_case/system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

cylinder.stl
{
	extractionMethod	extractFromSurface;
	
	extractFromSurfaceCoeffs
	{
		includedAngle 150;	
	}
	
	writeObj		yes;
}

/*heater.stl						//einfach kopieren und an .stl files anpassen
{
	extractionMethod	extractFromSurface;
	
	extractFromSurfaceCoeffs
	{
		includedAngle 150;	
	}
	
	writeObj		yes;
}*/
